GENDER_LIST = [
    "Мужской",
    "Женский"
]

GAME_LIST = {
    "PUBG": "🎯 PUBG 🎯",
    "Dota 2": "⚔️ Dota 2 ⚔️",
    "Genshin Impact": "🌸 Genshin Impact 🌸",
    "Counter-Strike 2": "🔫 Counter-Strike 2 🔫",
    "Valorant": "🎨 Valorant 🎨",
    "Call of Duty": "💥 Call of Duty 💥",
    "Warcraft": "🐉 Warcraft 🐉",
    "League of Legends": "🧿 League of Legends 🧿",
    "Mobile Legends": "📱 Mobile Legends 📱",
    "Fortnite": "🏗 Fortnite 🏗",
    "Raid Shadow Legends": "💎 Raid Shadow Legends 💎",
    "WoR": "🌠 WoR 🌠"
}

PROFILE_SAMPLE = """
<b>Ник</b>: {nickname}
<b>Тег</b>: {telegram_tag}
<b>Пол</b>: {gender}
<b>Игры</b>: {game}
<b>Удобное время</b>: {time}
<b>О себе</b>: {about}
<b>Цели поиска</b>: {goal}
"""
PHOTO_SAMPLE = "<b>Аватарка</b>: Нет"

CLAN_SAMPLE = """
<b>Название:</b>  {name}
<b>Игра:</b> {game}
<b>Описание клана:</b> {description}
<b>Требования:</b> {demands}
"""

FULL_PROFILE_SAMPLE = """
<b>Ник:</b> {nickname}
<b>Тег:</b> {telegram_tag}
<b>Пол:</b> {gender}
<b>Уровень:</b> {level}⚡
<b>Вежливость:</b> {polite}
<b>Скилл:</b> {skill}
<b>Командная игра:</b> {team_game}
<b>Игры:</b> {games}{rank}{add_info}
"""

PROFILE_ADD_INFO = """
<b>Удобное время</b>: {time}
<b>О себе:</b> {about}
<b>Цели:</b> {goal}
"""

CONNECT_LIST = [
    "В процессе⌛",
    "Да, получилось✅",
    "Нет ❌"
]


FIELDS_LIST = [
    "Никнейм",
    "Телеграм тег",
    "Пол",
    "Игры",
    "О себе",
    "Цели",
    "Фото"]


GOALS_LIST = [
    "Отдых и общение", 
    "Поднятие рейтинга", 
    "Поднятие скилла", 
    "PvP",
    "PvE",
    "Фарм/гринд", 
    "Обмен опытом", 
    "Закрыть ачивки", 
    "Кооп-ивенты", 
    "Турниры",
]

CONVENIENT_TIME = [
    "🌅 Утро (06:00–12:00)",
    "🌤️ День (12:00–18:00)",
    "🌆 Вечер (18:00–23:00)",
    "🌙 Ночь (23:00–06:00)",
    "🎉 По выходным",
]

DONATE_TEXT = "Донатишь? 😏"

BUDGET_TEXT = "Примерный бюджет в месяц в долларах."
BUDGETS = [
    ">1",
    "5-10$",
    "20-20$",
    ">20$",
]

TRANSFER_TEXT = "Готов к трансферу на другой сервер?"