SERVER_TEXT = "Выбери свой сервер из списка ниже👇"

East = [
    "Барц", 
    "Зигхард",
    "Леона",
    "Эрика",
]

West = [
    "Bartz 1", 
    "Bartz 2",
    "Bartz 3", 
    "Bartz 4",

]

JP = [
    "Eden", 
    "Fafurion 1",
    "Fafurion 2", 
    "Fafurion 3",
    "Fafurion 4", 
    "Lindvior 1",
    "Lindvior 2", 
    "Lindvior 3",
    "Lindvior 4", 
    "Saiha",
]

RASA_TEXT = "Выбери свою расу из списка ниже👇"
RASES = [
    "Человек", 
    "Камаэль",
    "Тёмный эльф", 
    "Орк",
    "Светлый эльф", 
    "Дворф",
]

CLASS_TEXT = "Укажи класс персонажа. Маг? Некр? А может лучник?�"
CLASSES = [
    "Воин",
    "Рыцарь",
    "Разбойник",
    "Лучник",
    "Маг",
    "Призыватель",
    "Некромант",
    "Жрец",
    "Танцор / Певец",
    "Боец",
    "Шаман",
    "Гном",
    "Камаэль",
]