PUBG = [
    "Бронза", 
    "Серебро", 
    "Золото", 
    "Платина", 
    "Алмаз", 
    "Мастер", 
    "Top-500"
]

DOTA2 = [ 
    "Рекрут", 
    "Страж", 
    "Рыцарь", 
    "Герой", 
    "Легенда", 
    "Властелин", 
    "Божество"
]

GENSHIN_IMPACT = [f"{num}-{num + 9}" for num in range(1, 61, 10)]

CS2 = [
    "Серебро", 
    "Золотая Звезда", 
    "Магистр Хранитель", 
    "Заслуженный Магистр-Хранитель", 
    "Легендарный Беркут", 
    "Великий Магистр Высшего Ранга", 
    "Всемирная Элита"
]

Valorant = [
    "Железо",  
    "Бронза",  
    "Серебро",  
    "Золото",  
    "Платина",  
    "Алмаз",  
    "Вознесённый",  
    "Бессмертный",  
    "Радиант" 
]

CALL_OF_DUTY = [
    "Бронза", 
    "Серебро", 
    "Золото", 
    "Платина", 
    "Бриллиант", 
    "Малиновый", 
    "Радужный", 
    "Топ 250"
]

WARCRAFT_MODES = [
    "2х2", 
    "3х3", 
    "5х5", 
    "БГ", 
    "PvE"
]

WARCRAFT = [f"{num}-{num + 99}" for num in range(1, 2700, 100)]

WARCRAFT_PvE = [
    "Эльвиннский лес",
    "Мулгор",
    "Дуротар",
    "Тёмные берега",
    "Степи",
    "Тернистая долина",
    "Западные Чумные земли",
    "Танарис",
    "Терраса Мудрости",
    "Зангартопь",
    "Награнд",
    "Острогорье",
    "Лезвие Скверны",
    "Полуостров Адского Пламени",
    "Ледяная Корона",
    "Подгород",
    "Штормград"
]

LEAGUE_OF_LEGENDS = [
"Железо IV–I", 
"Бронза IV–I", 
"Серебро IV–I", 
"Золото IV–I", 
"Платина IV–I", 
"Изумруд IV–I", 
"Алмаз IV–I", 
"Мастер",
"Грандмастер",
"Претендент"
]

MOBILE_LEGENDS = [
    "Воин III–I",  
    "Элита IV–I",  
    "Мастер IV–I",  
    "Грандмастер V–I",  
    "Эпик V–I", 
    "Легенда V–I", 
    "Мифик",
    "Мифический Почёт",  
    "Мифическая Слава",  
    "Мифическое Бессмертие"
]


FORTNITE = [
    "Бронза", 
    "Серебро", 
    "Золото", 
    "Платина", 
    "Алмаз", 
    "Elite", 
    "Champion", 
    "Unreal"
]

GAMES_RANKS = {
    "PUBG": PUBG,
    "Dota 2": DOTA2,
    "Genshin Impact": GENSHIN_IMPACT,
    "Counter-Strike 2": CS2,
    "Valorant": Valorant,
    "Call of Duty": CALL_OF_DUTY,
    "League of Legends": LEAGUE_OF_LEGENDS,
    "Mobile Legends": MOBILE_LEGENDS,
    "Fortnite": FORTNITE,
}