CLUSTER_TEXT = """
Выбери кластер, на котором ты играешь в Raven 2. По нему будет формироваться поиск и рекомендации тиммейтов.
"""

CLUSTERS = [
    "Umbro",
    "Tempus"
]

SERVER_TEXT = """
Выбери свой сервер из списка ниже👇
"""

SERVERS = [
    "Fides",
    "Mors",
    "Salus",
    "Honor",
    "Metus",
    "Dolor"
]

CLASS_TEXT = """
Укажи класс персонажа. Маг? Некр? А может лучник?🏹
"""

CLASSES = [
    "Убийца",
    "Берсерк",
    "Вестник смерти",
    "Разрушитель",
    "Заклинатель",
    "Хозяин стихий",
    "Стрелок",
    "Следопыт",
    "Защитник",
    "Без класса"
]

LEVEL_TEXT = """
Введи уровень персонажа числом.
Например: 81
Буквы и символы не принимаются.
"""

STATS_TEXT = """
Введи свои статы в формате 3 чисел через "/". Они указаны в
верхнем левом углу игры.
Пример: 480/500/666
"""
