CLASTER_TEXT = """
Выбери кластер, на котором ты играешь в Raven 2. По нему будет
формироваться поиск и рекомендации тиммейтов.
"""

CLASTERS = [
    "Umbro",
    "Tempus"
]

SERVER_TEXT = """
Выбери свой сервер из списка ниже�
"""

SERVERS = [
    "Fides",
    "Mors",
    "Salus",
    "Honor",
    "Metus",
    "Dolor"
]

CLASS_TEXT = """
Укажи класс персонажа. Маг? Некр? А может лучник?�
"""

CLASSES = [
    "Убийца",
    "Берсерк",
    "Вестник смерти",
    "Разрушитель",
    "Заклинатель",
    "Хозяин стихий",
    "Стрелок",
    "Следопыт",
    "Защитник",
    "Без класса"
]

